DEFINE DATA LOCAL
01 NUMVALUE (N5)
01 MESSAGE  (A50)
END-DEFINE
*
REPEAT UNTIL NUMVALUE = 20
NUMVALUE := NUMVALUE + 1
*
DECIDE ON FIRST VALUE OF NUMVALUE
VALUES 1 : 3 MOVE "value is 1, 2 or 3" TO MESSAGE
VALUES 5 MOVE "value is 5" TO MESSAGE
VALUES 7 , 8 , 10 MOVE "value is 7, 8 or 10" TO MESSAGE
VALUES 13, 15 : 18 MOVE "value is 13 or in range 15 - 18" TO MESSAGE
NONE VALUES MOVE "value invalid" TO MESSAGE
END-DECIDE
*
WRITE NUMVALUE (EM=Z9) MESSAGE
*
END-REPEAT
*
END
